This is the plan I see, let me know if that works:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_bigquery_dataset.dataproc-sink-dataset["terra_dev_aou_test"] will be destroyed
  - resource "google_bigquery_dataset" "dataproc-sink-dataset" {
      - creation_time                   = 1582324359557 -> null
      - dataset_id                      = "WorkspaceDataprocLogs" -> null
      - default_partition_expiration_ms = 0 -> null
      - default_table_expiration_ms     = 0 -> null
      - delete_contents_on_destroy      = false -> null
      - description                     = "Dataproc audit log sink for projects in Terra perimeter terra_dev_aou_test" -> null
      - etag                            = "FIb6GDB3dn+diMcTIK5M4w==" -> null
      - id                              = "projects/fc-aou-logs-test/datasets/WorkspaceDataprocLogs" -> null
      - labels                          = {
          - "perimeter" = "terra_dev_aou_test"
        } -> null
      - last_modified_time              = 1588874043868 -> null
      - location                        = "US" -> null
      - project                         = "fc-aou-logs-test" -> null
      - self_link                       = "https://www.googleapis.com/bigquery/v2/projects/fc-aou-logs-test/datasets/WorkspaceDataprocLogs" -> null

      - access {
          - role          = "OWNER" -> null
          - user_by_email = "terraform@broad-dsde-dev.iam.gserviceaccount.com" -> null
        }
      - access {
          - role          = "WRITER" -> null
          - user_by_email = "f737976594150-629055@gcp-sa-logging.iam.gserviceaccount.com" -> null
        }
    }

  # google_bigquery_dataset.runtime-sink-dataset["terra_dev_aou_test"] will be created
  + resource "google_bigquery_dataset" "runtime-sink-dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "WorkspaceRuntimeLogs"
      + delete_contents_on_destroy = false
      + description                = "Leonardo Runtime audit log sink (GCE / Datparoc) for projects in Terra perimeter terra_dev_aou_test"
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + labels                     = {
          + "perimeter" = "terra_dev_aou_test"
        }
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + project                    = "fc-aou-logs-test"
      + self_link                  = (known after apply)

      + access {
          + role          = "OWNER"
          + user_by_email = "terraform@broad-dsde-dev.iam.gserviceaccount.com"
        }
      + access {
          + role          = "WRITER"
          + user_by_email = (known after apply)
        }
    }

  # google_folder.folder["terra_dev_notebook_test"] will be destroyed
  - resource "google_folder" "folder" {
      - create_time     = "2020-03-17T19:05:56.212Z" -> null
      - display_name    = "terra_dev_notebook_test" -> null
      - id              = "folders/935913173367" -> null
      - lifecycle_state = "ACTIVE" -> null
      - name            = "folders/935913173367" -> null
      - parent          = "organizations/400176686919" -> null
    }

  # google_logging_folder_sink.dataproc-audit-sink["terra_dev_aou_test"] will be destroyed
  - resource "google_logging_folder_sink" "dataproc-audit-sink" {
      - destination      = "bigquery.googleapis.com/projects/fc-aou-logs-test/datasets/WorkspaceDataprocLogs" -> null
      - filter           = "resource.type=\"cloud_dataproc_cluster\" AND (logName:\"/logs/welder\" OR logName:\"/logs/jupyter\")" -> null
      - folder           = "737976594150" -> null
      - id               = "folders/737976594150/sinks/terra_dev_aou_test-dataproc-audit-sink" -> null
      - include_children = true -> null
      - name             = "terra_dev_aou_test-dataproc-audit-sink" -> null
      - writer_identity  = "serviceAccount:f737976594150-629055@gcp-sa-logging.iam.gserviceaccount.com" -> null

      - bigquery_options {
          - use_partitioned_tables = true -> null
        }
    }

  # google_logging_folder_sink.runtime-audit-sink["terra_dev_aou_test"] will be created
  + resource "google_logging_folder_sink" "runtime-audit-sink" {
      + destination      = "bigquery.googleapis.com/projects/fc-aou-logs-test/datasets/WorkspaceRuntimeLogs"
      + filter           = "(resource.type=\"cloud_dataproc_cluster\" OR resource.type=\"gce_instance\" AND (logName:\"/logs/welder\" OR logName:\"/logs/jupyter\")"
      + folder           = "737976594150"
      + id               = (known after apply)
      + include_children = true
      + name             = "terra_dev_aou_test-runtime-audit-sink"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = true
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```